---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator
source: html/6280338d-719e-728b-99f6-d37e42cd31fb.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator

An iterator to a set of items from ConduitSizeSettings. Each item is a KeyValuePair(System::String^, ConduitSizes).
 ElementId is the id of the conduit standard type.

## Syntax (C#)
```csharp
public class ConduitSizeSettingIterator : IEnumerator<KeyValuePair<string, ConduitSizes>>
```